Revit 2024 API
ImageInstance.Create Method
 Creates a new ImageInstance element placed in a view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public static ImageInstance Create(
	Document document,
	View view,
	ElementId imageTypeId,
	ImagePlacementOptions placementOptions
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	view As View, _
	imageTypeId As ElementId, _
	placementOptions As ImagePlacementOptions _
) As ImageInstance
Visual C++
public:
static ImageInstance^ Create(
	Document^ document,
	View^ view,
	ElementId^ imageTypeId,
	ImagePlacementOptions^ placementOptions
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
view
Type: Autodesk.Revit.DB.View
 The view in which the image will be placed.
imageTypeId
Type: Autodesk.Revit.DB.ElementId
 The id of the ImageType element for this ImageInstance.
placementOptions
Type: Autodesk.Revit.DB.ImagePlacementOptions
 Options that specify where the ImageInstance should be placed.
Return Value
 The new ImageInstance.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given view cannot contain ImageInstance elements -or- The given imageTypeId can not be used as a ImageType for ImageInstance elements -or- The given placementOptions specify a location that is more than 10 miles from the origin of the model.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
ImageInstance Class
Autodesk.Revit.DB Namespace